package com.poppin.poppinserver.core.util;

import org.springframework.stereotype.Component;

import java.util.HashSet;
import java.util.Set;

@Component
public class RandomNicknameUtil {
    private static final String[] adjectives = {
            "아름다운", "즐거운", "기쁜", "맑은", "밝은", "건강한", "활발한", "조용한", "빠른", "따뜻한",
            "신선한", "부드러운", "예쁜", "편안한", "깨끗한", "고요한", "부유한", "젊은", "맛있는", "민감한",
            "재미있는", "강력한", "밝은", "유명한", "넓은", "비싼", "긴", "높은", "많은", "무거운",
            "행복한", "확실한", "촉촉한", "깊은", "쉬운", "빛나는", "선명한", "고요한", "안전한", "강한",
            "거대한", "화려한", "귀여운", "우아한", "급한", "느긋한", "환한", "침착한", "멋진", "친절한",
            "착한", "똑똑한", "정확한", "재빠른", "적극적인", "따스한", "유쾌한", "훌륭한", "흥미진진한", "배려깊은",
            "창의적인", "당당한", "평화로운", "리더십 있는", "섬세한", "애정이 깊은", "용감한", "인내심 있는", "꾸준한", "활기찬",
            "실용적인", "관대한", "성실한", "자비로운", "열정적인", "꼼꼼한", "믿음직한", "도덕적인", "영리한", "기분 좋은",
            "상쾌한", "풍부한", "뛰어난", "감동적인", "승리한", "희망찬", "동정심 많은", "애정 어린", "유익한", "놀라운"
    };

    private static final String[] nouns = {
            "고양이", "개", "새", "물고기", "햄스터", "거북이", "토끼", "파충류", "개미", "나비",
            "벌", "강아지", "사슴", "여우", "늑대", "곰", "원숭이", "돼지", "소", "양",
            "염소", "말", "닭", "오리", "거위", "타조", "공작", "호랑이", "사자", "표범",
            "사막여우", "청설모", "고릴라", "침팬지", "코알라", "늑대거미", "가재", "풍뎅이", "사슴벌레", "지네",
            "수달", "스컹크", "하이에나", "코요테", "바다사자", "펭귄", "알바트로스", "독수리", "매", "부엉이",
            "카멜레온", "이구아나", "코브라", "비단뱀", "왕도마뱀", "악어", "악어거북", "도마뱀", "살모사", "거북",
            "맹꽁이", "도롱뇽", "개구리", "투구게", "문어", "오징어", "해마", "장수풍뎅이", "바다거북", "가오리",
            "해파리", "바다코끼리", "바다표범", "고래상어", "돌고래", "범고래", "밍크고래", "대왕오징어", "낙타", "라마",
            "스라소니", "재규어", "쿠거", "스노우 레오파드", "청개구리", "박쥐", "알파카", "비버", "라쿤", "바비루사",
            "올빼미", "앵무새", "캥거루", "와라비", "웜뱃", "타조", "카피바라", "타피르", "하마", "흰코뿔소",
            "흑코뿔소", "가젤", "봉고", "프레리독", "캐터필러", "앤틸로프", "아르마딜로", "마못", "바실리스크", "연어",
            "날치", "트라우트", "백상아리", "청상아리", "쏠배감펭", "방울뱀", "파이썬", "모란봉", "앵무새", "비둘기",
            "까치", "잉어", "금붕어", "복어", "말미잘", "불가사리", "산호", "참치", "멸치", "꽃게"
    };

    private static Set<String> usedNicknames = new HashSet<>();

    public static String generateRandomNickname() {
        String nickname = "";
        do {
            int adjectiveIndex = (int) (Math.random() * adjectives.length);
            int nounIndex = (int) (Math.random() * nouns.length);
            nickname = adjectives[adjectiveIndex] + " " + nouns[nounIndex];
        } while (usedNicknames.contains(nickname) || nickname.length() > 10);
        usedNicknames.add(nickname);
        return nickname;
    }
}
